[
  {
    "id": 1,
    "title": "Grand Theft Auto V",
    "coverPhoto": "https://i.ibb.co.com/j9MZZSY7/2506-1920x1200-desktop-hd-grand-theft-auto-5-background.jpg",
    "category": "Action-Adventure",
    "downloadLink": "https://www.rockstargames.com/gta-v",
    "description": "Grand Theft Auto V is an expansive and immersive open-world action-adventure game set in the fictional state of San Andreas, based on Southern California. The single-player story follows three protagonists—retired bank robber Michael De Santa, street gangster Franklin Clinton, and drug dealer Trevor Philips—whose lives become intertwined as they execute increasingly complex heists and face mounting pressure from a corrupt government agency and powerful criminals. Beyond the main narrative, the game offers a massive, detailed environment where players can drive various vehicles, fly aircraft, engage in gunfights, and participate in a wide array of side missions and activities. The multiplayer component, GTA Online, provides an evolving, persistent world where players can complete missions, build businesses, and interact with thousands of other players in a dynamic virtual Los Santos. This combination of deep storytelling, unparalleled freedom, and continuous online updates has made GTA V one of the best-selling and most critically acclaimed games of all time.",
    "ratings": 4.8,
    "developer": "Rockstar North"
  },
  {
    "id": 2,
    "title": "The Witcher 3: Wild Hunt",
    "coverPhoto": "https://i.ibb.co.com/PZ98L5cW/game-id-2.jpg",
    "category": "Action RPG",
    "downloadLink": "https://www.thewitcher.com/en/witcher3",
    "description": "The Witcher 3: Wild Hunt is a sprawling, story-driven open-world action role-playing game that puts the player in control of Geralt of Rivia, a professional monster slayer known as a Witcher. Set in a visually stunning medieval fantasy realm, the game’s primary quest involves hunting down Ciri, Geralt's adopted daughter, who is fleeing the otherworldly Wild Hunt. The game is renowned for its maturity, moral ambiguity, and consequence-driven narrative, where player choices have significant and often complex impacts on the world and its inhabitants, leading to one of 36 different endings. Exploration is key, as players traverse vast continents on horseback and boat, encountering vibrant cities, dangerous swamps, and hidden monster lairs. The combat system blends tactical, magic-infused sword fighting with a deep alchemy system and the use of Witcher Signs (spells), demanding strategic thinking to defeat a wide variety of mythical beasts. The game is also famous for its deeply realized side quests, which often feature writing quality equal to the main story, providing hundreds of hours of immersive gameplay.",
    "ratings": 4.9,
    "developer": "CD Projekt Red"
  },
  {
    "id": 3,
    "title": "Minecraft",
    "coverPhoto": "https://i.ibb.co.com/VpVgSs5y/game-id-3.jpg",
    "category": "Sandbox, Survival",
    "downloadLink": "https://www.minecraft.net/en-us",
    "description": "Minecraft is a sandbox video game that gives players endless freedom to create, explore, and survive in a blocky, procedurally generated 3D world. Players can gather resources, craft tools, build structures, and fight hostile mobs like zombies and creepers, primarily in the Survival Mode, where the goal is to manage hunger and health while advancing through technology trees. Alternatively, the Creative Mode offers unlimited resources and the ability to fly, allowing players to build massive, intricate structures and worlds without threat. The game’s appeal lies in its simplicity and profound creative potential; players have used the game engine to replicate real-world landmarks, build complex working computers using 'Redstone' circuitry, and invent new games within the game's environment. The core gameplay loop—exploring, mining, building, and enchanting—provides a tranquil yet challenging experience that caters to a diverse audience, from casual builders to dedicated survivalists and technical players. Its massive modding community and cross-platform accessibility further contribute to its status as a cultural phenomenon.",
    "ratings": 4.7,
    "developer": "Mojang Studios"
  },
  {
    "id": 4,
    "title": "Red Dead Redemption 2",
    "coverPhoto": "https://i.ibb.co.com/mFgvF4bP/game-id-4.jpg",
    "category": "Action-Adventure",
    "downloadLink": "https://www.rockstargames.com/reddeadredemption2",
    "description": "Red Dead Redemption 2 is a critically acclaimed Western-themed action-adventure game and the prequel to the original Red Dead Redemption. It is set in 1899 and chronicles the life of Arthur Morgan, an outlaw and member of the Van der Linde gang, as they struggle to survive in a fictionalized version of the American Old West amidst the decline of the wild west era and the rise of law enforcement. The game features an incredibly detailed and reactive open world, where player interaction with the environment and non-player characters carries weight, impacting Arthur's 'Honor' system which influences the story and dialogue. Gameplay revolves around horseback riding, hunting, engaging in intense gun battles with a slow-motion 'Dead Eye' mechanic, and managing the gang's resources. The attention to detail in the world—from dynamic weather and realistic animal behavior to the complex motivations of the characters—establishes an unparalleled level of immersion. The game also includes a massive online multiplayer component, Red Dead Online, allowing players to forge their own paths as cowboys, traders, or bounty hunters in the vast American frontier.",
    "ratings": 4.9,
    "developer": "Rockstar Games"
  },
  {
    "id": 5,
    "title": "League of Legends",
    "coverPhoto": "https://i.ibb.co.com/XcwfbmV/game-id-5.jpg",
    "category": "MOBA",
    "downloadLink": "https://www.leagueoflegends.com/en-us/",
    "description": "League of Legends (LoL) is a highly competitive, free-to-play multiplayer online battle arena (MOBA) game where two teams of five players, each controlling a unique 'Champion' with distinct abilities, battle to destroy the opponent's 'Nexus' base. The core gameplay takes place on a three-lane map where players earn gold and experience by defeating AI-controlled minions, monsters, and enemy champions to power up their character over the course of the match. Success requires a strategic blend of individual skill, communication, teamwork, and item building to counter the opposing team's composition. With a roster of over 150 champions, the game offers immense replayability and strategic depth, ensuring that no two matches are ever quite the same. Its highly structured, fast-paced nature, combined with a thriving professional esports scene and constant updates introducing new champions and gameplay features, cement its position as one of the most popular and enduring online competitive games in the world, requiring significant dedication to master.",
    "ratings": 4.6,
    "developer": "Riot Games"
  },
  {
    "id": 6,
    "title": "Elden Ring",
    "coverPhoto": "https://i.ibb.co.com/vCLN1Y7Y/game-id-6.jpg",
    "category": "Action RPG",
    "downloadLink": "https://en.bandainamcoent.eu/elden-ring/elden-ring",
    "description": "Elden Ring is a massive, critically acclaimed action role-playing game developed by FromSoftware, known for their challenging 'Souls-like' games, and features a fantasy world co-created with author George R. R. Martin. Set in the Lands Between, the game gives players unprecedented freedom to explore a vast, seamless open world on horseback, filled with mysterious dungeons, towering castles, and deadly secrets. The core gameplay retains the demanding, methodical, and high-stakes combat of previous 'Souls' titles but introduces new mechanics like jump attacks, horseback combat, and a stealth system, broadening the range of player strategies. The narrative is delivered through cryptic environmental storytelling, item descriptions, and fragmented character dialogues, encouraging player curiosity and exploration to piece together the history of the Lands Between and the shattering of the Elden Ring. With its diverse arsenal of weapons, spells, and character build customization, the game offers an immense, challenging, and rewarding experience for players willing to delve into its dark, beautiful, and punishing world.",
    "ratings": 4.8,
    "developer": "FromSoftware"
  },
  {
    "id": 7,
    "title": "Cyberpunk 2077",
    "coverPhoto": "https://i.ibb.co.com/RppsLFcX/game-id-7.jpg",
    "category": "Action RPG",
    "downloadLink": "https://www.cyberpunk.net/us/en/",
    "description": "Cyberpunk 2077 is an open-world action role-playing game set in the visually stunning, neon-drenched metropolis of Night City, a megacity obsessed with power, glamour, and body modification. Players assume the role of V, a customizable mercenary engaging in a complex narrative driven by the pursuit of a unique implant that is the key to immortality. The game features a deep character customization system that allows players to specialize in combat, hacking, or stealth skills, influencing both dialogue options and combat encounters. Exploration is key, as players navigate the vast districts of Night City via futuristic vehicles and traverse vertical skyscrapers, encountering a rich cast of compelling characters with their own motivations. The combat system combines first-person shooting with RPG elements, allowing the use of advanced cybernetic augmentations ('cyberware') and a variety of unique weaponry. Despite a troubled launch, subsequent updates and expansions have refined the experience, making Cyberpunk 2077 a dense, atmospheric, and narratively rich sci-fi adventure that explores themes of transhumanism and corporate control.",
    "ratings": 4.4,
    "developer": "CD Projekt Red"
  },
  {
    "id": 8,
    "title": "Apex Legends",
    "coverPhoto": "https://i.ibb.co.com/p63dw4vL/1268013-3840x2160-desktop-4k-apex-legends-wallpaper-image.jpg",
    "category": "Battle Royale, FPS",
    "downloadLink": "https://www.ea.com/games/apex-legends",
    "description": "Apex Legends is a free-to-play, squad-based battle royale and hero shooter game that distinguishes itself with a focus on fast-paced movement, team synergy, and unique character abilities. Set in the Titanfall universe, the game features a growing roster of 'Legends,' each possessing unique tactical, passive, and ultimate abilities that encourage strategic team compositions. Matches involve 60 players dropping onto a progressively shrinking map to scavenge for weapons, armor, and gear while eliminating opponents. Key innovative features include the 'Ping System,' which allows for clear, contextual, non-verbal communication with teammates, and a robust resurrection mechanic that keeps teammates in the fight longer. The gameplay loop is characterized by rapid decision-making, vertical combat, and constant repositioning, making it highly dynamic and skill-intensive. Regular seasonal updates introduce new maps, Legends, and weapons, continually refreshing the meta and maintaining its high popularity within the competitive online shooter landscape. The game's success is rooted in its excellent gunplay combined with the strategic layer of its hero shooter elements.",
    "ratings": 4.6,
    "developer": "Respawn Entertainment"
  },
  {
    "id": 9,
    "title": "Stardew Valley",
    "coverPhoto": "https://i.ibb.co.com/4ZLb6chL/game-id-9.jpg",
    "category": "Simulation, RPG",
    "downloadLink": "https://www.stardewvalley.net/",
    "description": "Stardew Valley is a charming, open-ended simulation role-playing game where the player inherits their grandfather's dilapidated farm plot in the titular valley. Escaping the monotony of corporate life, the player is tasked with restoring the farm to its former glory. The game features a variety of activities beyond farming, including mining for resources and battling monsters in the local caves, fishing in different bodies of water, and foraging for wild goods. A major component is the social simulation, where players can interact with and build relationships with the dozens of unique townsfolk, eventually leading to marriage and family. The game operates on an in-game calendar, with seasons impacting crops, festivals, and activities, promoting a relaxing yet addictive daily routine. Its distinctive pixel art style and calming soundtrack contribute to its cozy, escapist appeal. The game’s gentle progression, coupled with the freedom to customize the farm and pursue different hobbies, provides a peaceful and richly detailed gaming experience that appeals to fans of farming and life simulators.",
    "ratings": 4.7,
    "developer": "ConcernedApe"
  }
]